# brew "cmake"
# brew "cocoapods"
# brew "dart-lang/dart/dart"
# brew "dnsmasq", restart_service: true
# brew "docker", link: false
# brew "dvm"   #Docker Version Manager
# brew "git-duet/tap/git-duet"
# brew "hyperkit"  #toolkit for embedding hypervisor capabilities in your application
# brew "ios-deploy"  #Install and debug iPhone apps from the command-line
# brew "libimobiledevice"
# brew "lua"
# brew "mariadb"
# brew "minikube"
# brew "neofetch"  #displays information about your operating system, software and hardware in an aesthetic and visually pleasing way
# brew "nim"  #systems programming language. It combines successful concepts from mature languages like Python, Ada and Modula.
# brew "nodenv"
# brew "openal-soft"  #Implementation of the OpenAL 3D audio API
# brew "operator-sdk"  #SDK for building Kubernetes applications
# brew "postgresql"
# cask "alacritty"  #A fast, cross-platform, OpenGL terminal emulator
# cask "android-studio"
# cask "balenaetcher"  #Tool to flash OS images to SD cards & USB drives
# cask "epic-games"
# cask "flycut"
# cask "google-cloud-sdk"
# cask "karabiner-elements"  #keyboard customizer
# cask "kitematic"  #Visual user interface for Docker Container management
# cask "mono-mdk"
# cask "unity-hub"
# cask "virtualbox"
# cask "virtualbox-extension-pack"
# cask "visual-studio"

brew "aspell"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "brew-cask-completion"
brew "cask"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "detox"   #utility designed to clean up filenames. It replaces difficult to work with characters, such as spaces, with standard equivalents
brew "direnv"
brew "exercism"  #help people become fluent in their programming language of choice
brew "ffmpeg"
brew "fzf"  #fuzzy finder
brew "gettext"
brew "git"
brew "git-crypt"
brew "gnupg"
brew "go"
brew "graphviz"
brew "helm"
brew "hopenpgp-tools"
brew "htop"
brew "hub"  #helps you do everyday GitHub tasks without ever leaving the terminal.
brew "hugo"  #Configurable static site generator
brew "ideviceinstaller"
brew "jq"
brew "jump"
brew "kubelogin"
brew "kubernetes-cli"
brew "libvorbis"
brew "midnight-commander"
brew "mysql-client@5.7"
brew "neovim"
brew "nmap"
brew "pinentry-mac"
brew "pre-commit"
brew "python"
brew "rbenv"
brew "rbenv-gemset"
brew "rclone"  #manage files on cloud storage
brew "ripgrep"
brew "sdl2"
brew "sdl2_gfx"
brew "sdl2_image"
brew "sdl2_mixer"
brew "sdl2_net"
brew "sdl2_ttf"
brew "sevenzip"
brew "shellcheck"
brew "skaffold"  #Easy and Repeatable Kubernetes Development
brew "st"  #simple statistics from the command line interface (CLI)
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "the_silver_searcher"  #A code searching tool similar to ack, with a focus on speed.
brew "tig"  #Tig is an ncurses-based text-mode interface for git.
brew "tmux"
brew "tree"
brew "unbound"  #Validating, recursive, caching DNS resolver
brew "vault"
brew "vim"
brew "watch"
brew "wget"
brew "ykman"  #Tool for managing your YubiKey configuration
brew "ykpers"  #YubiKey personalization library and tool
brew "youtube-dl"
brew "yq"
brew "z"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "1password-cli"
cask "anaconda"
cask "blender"
cask "brave-browser"
cask "firefox"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-fira-code"
cask "font-iosevka"
cask "gimp"
cask "godot"
cask "google-chrome"
cask "insomnia"
cask "iterm2"
cask "keepassxc"
# cask "libreoffice"
cask "meld"
cask "sensiblesidebuttons"  ## enable back/forward mouse buttons
cask "shottr"
cask "skype"
cask "slack"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
tap "Azure/kubelogin"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "terraform-docs/tap"
